---
kind: other
id: Properties.T:Autodesk.Revit.DB.Events.ExternalDataInstanceAddedIntoDocumentEventArgs
source: html/f6377187-f6a9-ab98-8404-fcc43952264f.htm
---
# ExternalDataInstanceAddedIntoDocumentEventArgs Properties

Indicates whether an event may be cancelled by an event delegate.